SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                          #  #  ##
#  #   #   #    #  #                    #  # ###
#  #####   #   ###    ###  #  #     # # ####  ##
#  #   #   #    #  #  #  # #  #      #     #  ##
#  #   #   #    #  #  #  #  ###     # #    # ####
#_____________________________#_________________________________________________
                           ###

attinyx41.build.board=AVR_ATTINYX41
attinyx41.build.core=tiny
attinyx41.build.variant=tinyx41_cw
attinyx41.build.export_merged_output=false
attinyx41.bootloader.extended_fuses=0b{bootloader.ulp_bits}{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41.bootloader.high_fuses=0b{bootloader.rstbit}101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx41.bootloader.rstbit=1
attinyx41.build.usbpinset=
attinyx41.build.tuneorcal=
attinyx41.build.softserabr=
attinyx41.build.softser=
attinyx41.upload.tool=avrdude
attinyx41.bootloader.tool=avrdude
attinyx41.build.bootloader=
attinyx41.bootloader.flashstring=

#########################
# Microcontroller menu  #
#########################
attinyx41.menu.chip.841=ATtiny841
attinyx41.menu.chip.841.build.mcu=attiny841
attinyx41.menu.chip.841.upload.maximum_size=8192
attinyx41.menu.chip.841.upload.maximum_data_size=512
attinyx41.menu.chip.441=ATtiny441
attinyx41.menu.chip.441.build.mcu=attiny441
attinyx41.menu.chip.441.upload.maximum_size=4096
attinyx41.menu.chip.441.upload.maximum_data_size=256

#########################
# Clocking menu options #
#########################
attinyx41.menu.clock.internal_8m_4v5=8 MHz (internal > 4.5V)
attinyx41.menu.clock.internal_8m_4v5.bootloader.low_fuses=0xE2
attinyx41.menu.clock.internal_8m_4v5.build.f_cpu=8000000L
attinyx41.menu.clock.internal_8m_4v5.build.speed=8m
attinyx41.menu.clock.internal_8m_4v5.build.clocksource=0
attinyx41.menu.clock.internal_8m_4v5.build.tuneorcal=-DCAL_NUDGE_DOWN
attinyx41.menu.clock.internal_8m=8 MHz (internal)
attinyx41.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx41.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx41.menu.clock.internal_8m.build.speed=8m
attinyx41.menu.clock.internal_8m.build.clocksource=0
attinyx41.menu.clock.internal_1m=1 MHz (internal)
attinyx41.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx41.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx41.menu.clock.internal_1m.build.speed=1m
attinyx41.menu.clock.internal_1m.build.clocksource=0x10
attinyx41.menu.clock.internal_4m=4 MHz (internal)
attinyx41.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx41.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx41.menu.clock.internal_4m.build.speed=4m
attinyx41.menu.clock.internal_4m.build.clocksource=0x10
attinyx41.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx41.menu.clock.internal_2m=2 MHz (internal)
attinyx41.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx41.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx41.menu.clock.internal_2m.build.speed=2m
attinyx41.menu.clock.internal_2m.build.clocksource=0x10
attinyx41.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx41.menu.clock.internal_16m=16 MHz (internal via tuning/guess)
attinyx41.menu.clock.internal_16m.bootloader.low_fuses=0xE2
attinyx41.menu.clock.internal_16m.build.f_cpu=16000000L
attinyx41.menu.clock.internal_16m.build.speed=16m
attinyx41.menu.clock.internal_16m.build.clocksource=0
attinyx41.menu.clock.crystal_16m=16 MHz (crystal)
attinyx41.menu.clock.crystal_16m.bootloader.low_fuses=0xEE
attinyx41.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx41.menu.clock.crystal_16m.build.speed=16
attinyx41.menu.clock.crystal_16m.build.clocksource=1
attinyx41.menu.clock.crystal_8m=8 MHz (crystal)
attinyx41.menu.clock.crystal_8m.bootloader.low_fuses=0xEE
attinyx41.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx41.menu.clock.crystal_8m.build.speed=8
attinyx41.menu.clock.crystal_8m.build.clocksource=1
attinyx41.menu.clock.crystal_20m=20 MHz (crystal)
attinyx41.menu.clock.crystal_20m.bootloader.low_fuses=0xEE
attinyx41.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx41.menu.clock.crystal_20m.build.speed=20
attinyx41.menu.clock.crystal_20m.build.clocksource=1
attinyx41.menu.clock.crystal_12m=12 MHz (crystal)
attinyx41.menu.clock.crystal_12m.bootloader.low_fuses=0xEE
attinyx41.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx41.menu.clock.crystal_12m.build.speed=12
attinyx41.menu.clock.crystal_12m.build.clocksource=1
attinyx41.menu.clock.crystal_6m=6 MHz (crystal)
attinyx41.menu.clock.crystal_6m.bootloader.low_fuses=0xED
attinyx41.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx41.menu.clock.crystal_6m.build.speed=6
attinyx41.menu.clock.crystal_6m.build.clocksource=1
attinyx41.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx41.menu.clock.crystal_18432k.bootloader.low_fuses=0xEE
attinyx41.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx41.menu.clock.crystal_18432k.build.speed=18432k
attinyx41.menu.clock.crystal_18432k.build.clocksource=1
attinyx41.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx41.menu.clock.crystal_14746k.bootloader.low_fuses=0xEE
attinyx41.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx41.menu.clock.crystal_14746k.build.speed=14746k
attinyx41.menu.clock.crystal_14746k.build.clocksource=1
attinyx41.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx41.menu.clock.crystal_11059k.bootloader.low_fuses=0xEE
attinyx41.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx41.menu.clock.crystal_11059k.build.speed=11059k
attinyx41.menu.clock.crystal_11059k.build.clocksource=1
attinyx41.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx41.menu.clock.crystal_9216k.bootloader.low_fuses=0xEE
attinyx41.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx41.menu.clock.crystal_9216k.build.speed=9216k
attinyx41.menu.clock.crystal_9216k.build.clocksource=1
attinyx41.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx41.menu.clock.crystal_7372k.bootloader.low_fuses=0xED
attinyx41.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx41.menu.clock.crystal_7372k.build.speed=7372k
attinyx41.menu.clock.crystal_7372k.build.clocksource=1
attinyx41.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx41.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx41.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx41.menu.clock.internal_12m.build.speed=12m
attinyx41.menu.clock.internal_12m.build.clocksource=0
attinyx41.menu.clock.internal_12m8=12.8 MHz (internal, tuned)
attinyx41.menu.clock.internal_12m8.bootloader.low_fuses=0xE2
attinyx41.menu.clock.internal_12m8.build.f_cpu=12800000L
attinyx41.menu.clock.internal_12m8.build.speed=12m
attinyx41.menu.clock.internal_12m8.build.clocksource=0
attinyx41.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx41.menu.clock.internal_8m_tuned_low.bootloader.low_fuses=0xE2
attinyx41.menu.clock.internal_8m_tuned_low.build.f_cpu=8000000L
attinyx41.menu.clock.internal_8m_tuned_low.build.speed=8m
attinyx41.menu.clock.internal_8m_tuned_low.build.clocksource=0
attinyx41.menu.clock.internal_8m_tuned_high=8 MHz (internal, tuned)
attinyx41.menu.clock.internal_8m_tuned_high.bootloader.low_fuses=0xE2
attinyx41.menu.clock.internal_8m_tuned_high.build.f_cpu=8000000L
attinyx41.menu.clock.internal_8m_tuned_high.build.speed=8m
attinyx41.menu.clock.internal_8m_tuned_high.build.clocksource=0
attinyx41.menu.clock.internal_128k=128 kHz (internal WDT)
attinyx41.menu.clock.internal_128k.build.f_cpu=128000L
attinyx41.menu.clock.internal_128k.build.speed=128k
attinyx41.menu.clock.internal_128k.build.clocksource=3
attinyx41.menu.clock.extclk_16m=16 MHz (external clock)
attinyx41.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx41.menu.clock.extclk_16m.build.speed=16
attinyx41.menu.clock.extclk_16m.build.clocksource=2
attinyx41.menu.clock.extclk_8m=8 MHz (external clock)
attinyx41.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx41.menu.clock.extclk_8m.build.speed=8
attinyx41.menu.clock.extclk_8m.build.clocksource=2
attinyx41.menu.clock.extclk_20m=20 MHz (external clock)
attinyx41.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx41.menu.clock.extclk_20m.build.speed=20
attinyx41.menu.clock.extclk_20m.build.clocksource=2
attinyx41.menu.clock.extclk_12m=12 MHz (external clock)
attinyx41.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx41.menu.clock.extclk_12m.build.speed=12
attinyx41.menu.clock.extclk_12m.build.clocksource=2
attinyx41.menu.clock.extclk_6m=6 MHz (external clock)
attinyx41.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx41.menu.clock.extclk_6m.build.speed=6
attinyx41.menu.clock.extclk_6m.build.clocksource=2
attinyx41.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx41.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx41.menu.clock.extclk_18432k.build.speed=18432k
attinyx41.menu.clock.extclk_18432k.build.clocksource=2
attinyx41.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx41.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx41.menu.clock.extclk_14746k.build.speed=14746k
attinyx41.menu.clock.extclk_14746k.build.clocksource=2
attinyx41.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx41.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx41.menu.clock.extclk_11059k.build.speed=11059k
attinyx41.menu.clock.extclk_11059k.build.clocksource=2
attinyx41.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx41.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx41.menu.clock.extclk_9216k.build.speed=9216k
attinyx41.menu.clock.extclk_9216k.build.clocksource=2
attinyx41.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx41.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx41.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx41.menu.clock.extclk_7372k.build.speed=7372k
attinyx41.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Pin Mapping menu      #
#########################
attinyx41.menu.pinmap.default=Standard (clockwise)
attinyx41.menu.pinmap.ccw=Legacy (counterclockwise)
attinyx41.menu.pinmap.ccw.build.variant=tinyx41_legacy
attinyx41.menu.pinmap.default.build.pinmapabr=.cw
attinyx41.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# Retain EEPROM menu    #
#########################
attinyx41.menu.eesave.aenable=EEPROM retained
attinyx41.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx41.menu.eesave.disable=EEPROM not retained
attinyx41.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# Wire Modes menu       #
#########################
attinyx41.menu.wiremode.master=Master Only
attinyx41.menu.wiremode.master.build.wiremode=-DWIRE_MASTER_ONLY
attinyx41.menu.wiremode.slave=Slave Only
attinyx41.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attinyx41.menu.wiremode.slave.build.wiremodeabr=wS
attinyx41.menu.wiremode.both=Either (uses more flash)
attinyx41.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attinyx41.menu.wiremode.slave.build.wiremodeabr=wB

#########################
# BrownOut Detect menu  #
#########################
attinyx41.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41.menu.bod.1v8.bootloader.bod_bits=110
attinyx41.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41.menu.bod.2v7.bootloader.bod_bits=101
attinyx41.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41.menu.bod.4v3.bootloader.bod_bits=100
attinyx41.menu.bodact.disabled=B.O.D. Disabled (saves power)
attinyx41.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41.menu.bodact.enabled=B.O.D. Enabled
attinyx41.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attinyx41.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41.menu.bodpd.enabled=B.O.D. Enabled
attinyx41.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attinyx41.menu.millis.enabled=Enabled
attinyx41.menu.millis.enabled.build.millis=
attinyx41.menu.millis.enabled.build.millisabr=
attinyx41.menu.millis.disabled=Disabled (saves flash)
attinyx41.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx41.menu.millis.disabled.build.millisabr=mNONE

