SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                          ###   ##  ###
#  #   #   #    #  #                       # ###     #
#  #####   #   ###    ###  #  #     # #  ##   ##   ##
#  #   #   #    #  #  #  # #  #      #     #  ##     #
#  #   #   #    #  #  #  #  ###     # # ###  #### ###
#_____________________________#_________________________________________________
                           ###

attinyx313.build.board=AVR_ATTINYX313
attinyx313.build.core=tiny
attinyx313.build.variant=tinyx313
attinyx313.build.export_merged_output=false
attinyx313.bootloader.extended_fuses=0xFE
attinyx313.bootloader.high_fuses=0b{bootloader.rstbit}101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx313.bootloader.rstbit=1
attinyx313.build.usbpinset=
attinyx313.build.tuneorcal=
attinyx313.build.softserabr=
attinyx313.build.softser=
attinyx313.build.wiremodeabr=
attinyx313.build.wiremode=
attinyx313.upload.tool=avrdude
attinyx313.bootloader.tool=avrdude
attinyx313.build.bootloader=
attinyx313.bootloader.flashstring=

#########################
# Microcontroller menu  #
#########################
attinyx313.menu.chip.4313=ATtiny4313
attinyx313.menu.chip.4313.build.mcu=attiny4313
attinyx313.menu.chip.4313.upload.maximum_size=4096
attinyx313.menu.chip.4313.upload.maximum_data_size=256
attinyx313.menu.chip.2313=ATtiny2313/ATtiny2313A
attinyx313.menu.chip.2313.build.mcu=attiny2313a
attinyx313.menu.chip.2313.upload.maximum_size=2048
attinyx313.menu.chip.2313.upload.maximum_data_size=128

#########################
# Clocking menu options #
#########################
attinyx313.menu.clock.internal_8m=8 MHz (internal)
attinyx313.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx313.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx313.menu.clock.internal_8m.build.speed=8m
attinyx313.menu.clock.internal_8m.build.clocksource=0
attinyx313.menu.clock.internal_1m=1 MHz (internal)
attinyx313.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx313.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx313.menu.clock.internal_1m.build.speed=1m
attinyx313.menu.clock.internal_1m.build.clocksource=0x10
attinyx313.menu.clock.internal_4m=4 MHz (internal)
attinyx313.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx313.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx313.menu.clock.internal_4m.build.speed=4m
attinyx313.menu.clock.internal_4m.build.clocksource=0x10
attinyx313.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx313.menu.clock.internal_2m=2 MHz (internal)
attinyx313.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx313.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx313.menu.clock.internal_2m.build.speed=2m
attinyx313.menu.clock.internal_2m.build.clocksource=0x10
attinyx313.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx313.menu.clock.crystal_16m=16 MHz (crystal)
attinyx313.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attinyx313.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx313.menu.clock.crystal_16m.build.speed=16
attinyx313.menu.clock.crystal_16m.build.clocksource=1
attinyx313.menu.clock.crystal_8m=8 MHz (crystal)
attinyx313.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attinyx313.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx313.menu.clock.crystal_8m.build.speed=8
attinyx313.menu.clock.crystal_8m.build.clocksource=1
attinyx313.menu.clock.crystal_20m=20 MHz (crystal)
attinyx313.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attinyx313.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx313.menu.clock.crystal_20m.build.speed=20
attinyx313.menu.clock.crystal_20m.build.clocksource=1
attinyx313.menu.clock.crystal_12m=12 MHz (crystal)
attinyx313.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attinyx313.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx313.menu.clock.crystal_12m.build.speed=12
attinyx313.menu.clock.crystal_12m.build.clocksource=1
attinyx313.menu.clock.crystal_6m=6 MHz (crystal)
attinyx313.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attinyx313.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx313.menu.clock.crystal_6m.build.speed=6
attinyx313.menu.clock.crystal_6m.build.clocksource=1
attinyx313.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx313.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attinyx313.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx313.menu.clock.crystal_18432k.build.speed=18432k
attinyx313.menu.clock.crystal_18432k.build.clocksource=1
attinyx313.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx313.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attinyx313.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx313.menu.clock.crystal_14746k.build.speed=14746k
attinyx313.menu.clock.crystal_14746k.build.clocksource=1
attinyx313.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx313.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attinyx313.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx313.menu.clock.crystal_11059k.build.speed=11059k
attinyx313.menu.clock.crystal_11059k.build.clocksource=1
attinyx313.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx313.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attinyx313.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx313.menu.clock.crystal_9216k.build.speed=9216k
attinyx313.menu.clock.crystal_9216k.build.clocksource=1
attinyx313.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx313.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attinyx313.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx313.menu.clock.crystal_7372k.build.speed=7372k
attinyx313.menu.clock.crystal_7372k.build.clocksource=1
attinyx313.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx313.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx313.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx313.menu.clock.internal_12m.build.speed=12m
attinyx313.menu.clock.internal_12m.build.clocksource=0
attinyx313.menu.clock.internal_12m8=12.8 MHz (internal, tuned)
attinyx313.menu.clock.internal_12m8.bootloader.low_fuses=0xE2
attinyx313.menu.clock.internal_12m8.build.f_cpu=12800000L
attinyx313.menu.clock.internal_12m8.build.speed=12m
attinyx313.menu.clock.internal_12m8.build.clocksource=0
attinyx313.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx313.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attinyx313.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attinyx313.menu.clock.internal_8m_tuned.build.speed=8m
attinyx313.menu.clock.internal_8m_tuned.build.clocksource=0
attinyx313.menu.clock.internal_128k=128 kHz (internal WDT)
attinyx313.menu.clock.internal_128k.build.f_cpu=128000L
attinyx313.menu.clock.internal_128k.build.speed=128k
attinyx313.menu.clock.internal_128k.build.clocksource=3
attinyx313.menu.clock.internal_128k.bootloader.low_fuses=0xC6
attinyx313.menu.clock.extclk_16m=16 MHz (external clock)
attinyx313.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx313.menu.clock.extclk_16m.build.speed=16
attinyx313.menu.clock.extclk_16m.build.clocksource=2
attinyx313.menu.clock.extclk_8m=8 MHz (external clock)
attinyx313.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx313.menu.clock.extclk_8m.build.speed=8
attinyx313.menu.clock.extclk_8m.build.clocksource=2
attinyx313.menu.clock.extclk_20m=20 MHz (external clock)
attinyx313.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx313.menu.clock.extclk_20m.build.speed=20
attinyx313.menu.clock.extclk_20m.build.clocksource=2
attinyx313.menu.clock.extclk_12m=12 MHz (external clock)
attinyx313.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx313.menu.clock.extclk_12m.build.speed=12
attinyx313.menu.clock.extclk_12m.build.clocksource=2
attinyx313.menu.clock.extclk_6m=6 MHz (external clock)
attinyx313.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx313.menu.clock.extclk_6m.build.speed=6
attinyx313.menu.clock.extclk_6m.build.clocksource=2
attinyx313.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx313.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx313.menu.clock.extclk_18432k.build.speed=18432k
attinyx313.menu.clock.extclk_18432k.build.clocksource=2
attinyx313.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx313.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx313.menu.clock.extclk_14746k.build.speed=14746k
attinyx313.menu.clock.extclk_14746k.build.clocksource=2
attinyx313.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx313.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx313.menu.clock.extclk_11059k.build.speed=11059k
attinyx313.menu.clock.extclk_11059k.build.clocksource=2
attinyx313.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx313.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx313.menu.clock.extclk_9216k.build.speed=9216k
attinyx313.menu.clock.extclk_9216k.build.clocksource=2
attinyx313.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx313.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx313.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx313.menu.clock.extclk_7372k.build.speed=7372k
attinyx313.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Retain EEPROM menu    #
#########################
attinyx313.menu.eesave.aenable=EEPROM retained
attinyx313.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx313.menu.eesave.disable=EEPROM not retained
attinyx313.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# BrownOut Detect menu  #
#########################
attinyx313.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx313.menu.bod.disable.bootloader.bod_bits=111
attinyx313.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx313.menu.bod.1v8.bootloader.bod_bits=110
attinyx313.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx313.menu.bod.2v7.bootloader.bod_bits=101
attinyx313.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx313.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx313.menu.millis.enabled=Enabled
attinyx313.menu.millis.enabled.build.millis=
attinyx313.menu.millis.enabled.build.millisabr=
attinyx313.menu.millis.disabled=Disabled (saves flash)
attinyx313.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx313.menu.millis.disabled.build.millisabr=mNONE

