SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      ####      ###
#  #   #   #    #  #                #        #   #       #  #
#  #####   #   ###    ###  #  # # # ###      #   # ###  ###
#  #   #   #    #  #  #  # #  #  #     #     #   # #  #  #  #
#  #   #   #    #  #  #  #  ### # # ###       ###  ###   #  #
#_____________________________#____________________#____________________________
                           ###                     #

attinyx5opti.build.board=AVR_ATTINYX5
attinyx5opti.build.core=tiny
attinyx5opti.build.variant=tinyx5
attinyx5opti.build.export_merged_output=false
attinyx5opti.bootloader.extended_fuses=0xFE
attinyx5opti.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx5opti.bootloader.rstbit=1
attinyx5opti.build.usbpinset=
attinyx5opti.build.tuneorcal=
attinyx5opti.build.softserabr=
attinyx5opti.build.softser=
attinyx5opti.build.wiremodeabr=
attinyx5opti.build.wiremode=
attinyx5opti.upload.tool=avrdude
attinyx5opti.bootloader.tool=avrdude
attinyx5opti.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
attinyx5opti.build.bootloader=-DUSING_BOOTLOADER=0x01
attinyx5opti.bootloader.speed={build.f_cpu}
attinyx5opti.upload.protocol=arduino
attinyx5opti.bootloader.uart=

#########################
# Microcontroller menu  #
#########################
attinyx5opti.menu.chip.85=ATtiny85
attinyx5opti.menu.chip.85.build.mcu=attiny85
attinyx5opti.menu.chip.85.upload.maximum_size=7616
attinyx5opti.menu.chip.85.upload.maximum_data_size=512
attinyx5opti.menu.chip.45=ATtiny45
attinyx5opti.menu.chip.45.build.mcu=attiny45
attinyx5opti.menu.chip.45.upload.maximum_size=3520
attinyx5opti.menu.chip.45.upload.maximum_data_size=256

#########################
# Clocking menu options #
#########################
attinyx5opti.menu.clock.internal_8m=8 MHz (internal)
attinyx5opti.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx5opti.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx5opti.menu.clock.internal_8m.build.speed=8m
attinyx5opti.menu.clock.internal_8m.build.clocksource=0
attinyx5opti.menu.clock.internal_8m.upload.speed=28800
attinyx5opti.menu.clock.internal_1m=1 MHz (internal)
attinyx5opti.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx5opti.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx5opti.menu.clock.internal_1m.build.speed=1m
attinyx5opti.menu.clock.internal_1m.build.clocksource=0x10
attinyx5opti.menu.clock.internal_1m.upload.speed=4800
attinyx5opti.menu.clock.internal_4m=4 MHz (internal)
attinyx5opti.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx5opti.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx5opti.menu.clock.internal_4m.build.speed=4m
attinyx5opti.menu.clock.internal_4m.build.clocksource=0x10
attinyx5opti.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx5opti.menu.clock.internal_4m.upload.speed=4800
attinyx5opti.menu.clock.internal_2m=2 MHz (internal)
attinyx5opti.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx5opti.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx5opti.menu.clock.internal_2m.build.speed=2m
attinyx5opti.menu.clock.internal_2m.build.clocksource=0x10
attinyx5opti.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx5opti.menu.clock.internal_2m.upload.speed=4800
attinyx5opti.menu.clock.pll_16m=16 MHz (PLL)
attinyx5opti.menu.clock.pll_16m.bootloader.low_fuses=0xF1
attinyx5opti.menu.clock.pll_16m.build.f_cpu=16000000L
attinyx5opti.menu.clock.pll_16m.build.f_cpu=16m
attinyx5opti.menu.clock.pll_16m.build.clocksource=6
attinyx5opti.menu.clock.pll_16m.upload.speed=57600
attinyx5opti.menu.clock.pll_16m5=16.5 MHz (PLL, tweaked)
attinyx5opti.menu.clock.pll_16m5.bootloader.low_fuses=0xF1
attinyx5opti.menu.clock.pll_16m5.build.f_cpu=16500000L
attinyx5opti.menu.clock.pll_16m5.build.speed=16m5
attinyx5opti.menu.clock.pll_16m5.build.clocksource=6
attinyx5opti.menu.clock.pll_16m5.upload.speed=57600
attinyx5opti.menu.clock.crystal_16m=16 MHz (crystal)
attinyx5opti.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx5opti.menu.clock.crystal_16m.build.speed=16
attinyx5opti.menu.clock.crystal_16m.build.clocksource=1
attinyx5opti.menu.clock.crystal_8m=8 MHz (crystal)
attinyx5opti.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx5opti.menu.clock.crystal_8m.build.speed=8
attinyx5opti.menu.clock.crystal_8m.build.clocksource=1
attinyx5opti.menu.clock.crystal_20m=20 MHz (crystal)
attinyx5opti.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx5opti.menu.clock.crystal_20m.build.speed=20
attinyx5opti.menu.clock.crystal_20m.build.clocksource=1
attinyx5opti.menu.clock.crystal_12m=12 MHz (crystal)
attinyx5opti.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx5opti.menu.clock.crystal_12m.build.speed=12
attinyx5opti.menu.clock.crystal_12m.build.clocksource=1
attinyx5opti.menu.clock.crystal_6m=6 MHz (crystal)
attinyx5opti.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attinyx5opti.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx5opti.menu.clock.crystal_6m.build.speed=6
attinyx5opti.menu.clock.crystal_6m.build.clocksource=1
attinyx5opti.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx5opti.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx5opti.menu.clock.crystal_18432k.build.speed=18432k
attinyx5opti.menu.clock.crystal_18432k.build.clocksource=1
attinyx5opti.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx5opti.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx5opti.menu.clock.crystal_14746k.build.speed=14746k
attinyx5opti.menu.clock.crystal_14746k.build.clocksource=1
attinyx5opti.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx5opti.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx5opti.menu.clock.crystal_11059k.build.speed=11059k
attinyx5opti.menu.clock.crystal_11059k.build.clocksource=1
attinyx5opti.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx5opti.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attinyx5opti.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx5opti.menu.clock.crystal_9216k.build.speed=9216k
attinyx5opti.menu.clock.crystal_9216k.build.clocksource=1
attinyx5opti.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx5opti.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attinyx5opti.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx5opti.menu.clock.crystal_7372k.build.speed=7372k
attinyx5opti.menu.clock.crystal_7372k.build.clocksource=1
attinyx5opti.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx5opti.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx5opti.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx5opti.menu.clock.internal_12m.build.speed=12m
attinyx5opti.menu.clock.internal_12m.build.clocksource=0
attinyx5opti.menu.clock.internal_12m.upload.speed=57600
attinyx5opti.menu.clock.internal_12m8=12.8 MHz (internal, tuned)
attinyx5opti.menu.clock.internal_12m8.bootloader.low_fuses=0xE2
attinyx5opti.menu.clock.internal_12m8.build.f_cpu=12800000L
attinyx5opti.menu.clock.internal_12m8.build.speed=12m
attinyx5opti.menu.clock.internal_12m8.build.clocksource=0
attinyx5opti.menu.clock.internal_12m8.upload.speed=57600
attinyx5opti.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx5opti.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attinyx5opti.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attinyx5opti.menu.clock.internal_8m_tuned.build.speed=8m
attinyx5opti.menu.clock.internal_8m_tuned.build.clocksource=0
attinyx5opti.menu.clock.internal_8m_tuned.upload.speed=28800
attinyx5opti.menu.clock.extclk_16m=16 MHz (external clock)
attinyx5opti.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx5opti.menu.clock.extclk_16m.build.speed=16
attinyx5opti.menu.clock.extclk_16m.build.clocksource=2
attinyx5opti.menu.clock.extclk_16m.upload.speed=57600
attinyx5opti.menu.clock.extclk_8m=8 MHz (external clock)
attinyx5opti.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx5opti.menu.clock.extclk_8m.build.speed=8
attinyx5opti.menu.clock.extclk_8m.build.clocksource=2
attinyx5opti.menu.clock.extclk_8m.upload.speed=28800
attinyx5opti.menu.clock.extclk_20m=20 MHz (external clock)
attinyx5opti.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx5opti.menu.clock.extclk_20m.build.speed=20
attinyx5opti.menu.clock.extclk_20m.build.clocksource=2
attinyx5opti.menu.clock.extclk_20m.upload.speed=57600
attinyx5opti.menu.clock.extclk_12m=12 MHz (external clock)
attinyx5opti.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx5opti.menu.clock.extclk_12m.build.speed=12
attinyx5opti.menu.clock.extclk_12m.build.clocksource=2
attinyx5opti.menu.clock.extclk_12m.upload.speed=57600
attinyx5opti.menu.clock.extclk_6m=6 MHz (external clock)
attinyx5opti.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx5opti.menu.clock.extclk_6m.build.speed=6
attinyx5opti.menu.clock.extclk_6m.build.clocksource=2
attinyx5opti.menu.clock.extclk_6m.upload.speed=28800
attinyx5opti.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx5opti.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx5opti.menu.clock.extclk_18432k.build.speed=18432k
attinyx5opti.menu.clock.extclk_18432k.build.clocksource=2
attinyx5opti.menu.clock.extclk_18432k.upload.speed=57600
attinyx5opti.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx5opti.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx5opti.menu.clock.extclk_14746k.build.speed=14746k
attinyx5opti.menu.clock.extclk_14746k.build.clocksource=2
attinyx5opti.menu.clock.extclk_14746k.upload.speed=57600
attinyx5opti.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx5opti.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx5opti.menu.clock.extclk_11059k.build.speed=11059k
attinyx5opti.menu.clock.extclk_11059k.build.clocksource=2
attinyx5opti.menu.clock.extclk_11059k.upload.speed=38400
attinyx5opti.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx5opti.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx5opti.menu.clock.extclk_9216k.build.speed=9216k
attinyx5opti.menu.clock.extclk_9216k.build.clocksource=2
attinyx5opti.menu.clock.extclk_9216k.upload.speed=38400
attinyx5opti.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx5opti.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx5opti.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx5opti.menu.clock.extclk_7372k.build.speed=7372k
attinyx5opti.menu.clock.extclk_7372k.build.clocksource=2
attinyx5opti.menu.clock.extclk_7372k.upload.speed=28800

#########################
# Software Serial menu  #
#########################
attinyx5opti.menu.softserial.enable=RX on PB1, TX on PB (default PB0)
attinyx5opti.menu.softserial.txonly=No receiving, transmit only.
attinyx5opti.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attinyx5opti.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attinyx5opti.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx5opti.menu.bod.disable.bootloader.bod_bits=111
attinyx5opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx5opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx5opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx5opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx5opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx5opti.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx5opti.menu.millis.enabled=Enabled
attinyx5opti.menu.millis.enabled.build.millis=
attinyx5opti.menu.millis.enabled.build.millisabr=
attinyx5opti.menu.millis.disabled=Disabled (saves flash)
attinyx5opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx5opti.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx5opti.menu.bootloadermode.1s=Standard (1s wait, for use w/autoreset)
attinyx5opti.menu.bootloadermode.1s.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}.hex
attinyx5opti.menu.bootloadermode.8s=8-second (8s wait, for use w. out/autoreset)
attinyx5opti.menu.bootloadermode.8s_8sec.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}_8sec.hex

