SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                        #    ##       ###
#  #   #   #    #  #                 #    ###      #   #       #  #
#  #####   #   ###    ###  #  # # # ####   ##      #   # ###  ###
#  #   #   #    #  #  #  # #  #  #  #   #  ##      #   # #  #  #  #
#  #   #   #    #  #  #  #  ### # #  ###  ####      ###  ###   #  #
#_____________________________#__________________________#______________________
                           ###                           #

attinyx61opti.build.board=AVR_ATTINYX61
attinyx61opti.build.core=tiny
attinyx61opti.build.variant=tinyx61
attinyx61opti.build.export_merged_output=false
attinyx61opti.bootloader.extended_fuses=0xFE
attinyx61opti.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx61opti.bootloader.rstbit=1
attinyx61opti.build.usbpinset=
attinyx61opti.build.tuneorcal=
attinyx61opti.build.softserabr=
attinyx61opti.build.softser=
attinyx61opti.build.wiremodeabr=
attinyx61opti.build.wiremode=
attinyx61opti.upload.tool=avrdude
attinyx61opti.bootloader.tool=avrdude
attinyx61opti.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
attinyx61opti.build.bootloader=-DUSING_BOOTLOADER=0x01
attinyx61opti.bootloader.speed={build.f_cpu}
attinyx61opti.upload.protocol=arduino
attinyx61opti.bootloader.uart=

#########################
# Microcontroller menu  #
#########################
attinyx61opti.menu.chip.861=ATtiny861
attinyx61opti.menu.chip.861.build.mcu=attiny861
attinyx61opti.menu.chip.861.upload.maximum_size=7552
attinyx61opti.menu.chip.861.upload.maximum_data_size=512
attinyx61opti.menu.chip.461=ATtiny461
attinyx61opti.menu.chip.461.build.mcu=attiny461
attinyx61opti.menu.chip.461.upload.maximum_size=3456
attinyx61opti.menu.chip.461.upload.maximum_data_size=256

#########################
# Clocking menu options #
#########################
attinyx61opti.menu.clock.internal_8m=8 MHz (internal)
attinyx61opti.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx61opti.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx61opti.menu.clock.internal_8m.build.speed=8m
attinyx61opti.menu.clock.internal_8m.build.clocksource=0
attinyx61opti.menu.clock.internal_8m.upload.speed=76800
attinyx61opti.menu.clock.internal_1m=1 MHz (internal)
attinyx61opti.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx61opti.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx61opti.menu.clock.internal_1m.build.speed=1m
attinyx61opti.menu.clock.internal_1m.build.clocksource=0x10
attinyx61opti.menu.clock.internal_1m.upload.speed=9600
attinyx61opti.menu.clock.internal_4m=4 MHz (internal)
attinyx61opti.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx61opti.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx61opti.menu.clock.internal_4m.build.speed=4m
attinyx61opti.menu.clock.internal_4m.build.clocksource=0x10
attinyx61opti.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx61opti.menu.clock.internal_4m.upload.speed=9600
attinyx61opti.menu.clock.internal_2m=2 MHz (internal)
attinyx61opti.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx61opti.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx61opti.menu.clock.internal_2m.build.speed=2m
attinyx61opti.menu.clock.internal_2m.build.clocksource=0x10
attinyx61opti.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx61opti.menu.clock.internal_2m.upload.speed=9600
attinyx61opti.menu.clock.pll_16m=16 MHz (PLL)
attinyx61opti.menu.clock.pll_16m.bootloader.low_fuses=0xF1
attinyx61opti.menu.clock.pll_16m.build.f_cpu=16000000L
attinyx61opti.menu.clock.pll_16m.build.f_cpu=16m
attinyx61opti.menu.clock.pll_16m.build.clocksource=6
attinyx61opti.menu.clock.pll_16m.upload.speed=76800
attinyx61opti.menu.clock.pll_16m5=16.5 MHz (PLL, tweaked)
attinyx61opti.menu.clock.pll_16m5.bootloader.low_fuses=0xF1
attinyx61opti.menu.clock.pll_16m5.build.f_cpu=16500000L
attinyx61opti.menu.clock.pll_16m5.build.speed=16m5
attinyx61opti.menu.clock.pll_16m5.build.clocksource=6
attinyx61opti.menu.clock.pll_16m5.upload.speed=115200
attinyx61opti.menu.clock.crystal_16m=16 MHz (crystal)
attinyx61opti.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx61opti.menu.clock.crystal_16m.build.speed=16
attinyx61opti.menu.clock.crystal_16m.build.clocksource=1
attinyx61opti.menu.clock.crystal_8m=8 MHz (crystal)
attinyx61opti.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx61opti.menu.clock.crystal_8m.build.speed=8
attinyx61opti.menu.clock.crystal_8m.build.clocksource=1
attinyx61opti.menu.clock.crystal_20m=20 MHz (crystal)
attinyx61opti.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx61opti.menu.clock.crystal_20m.build.speed=20
attinyx61opti.menu.clock.crystal_20m.build.clocksource=1
attinyx61opti.menu.clock.crystal_12m=12 MHz (crystal)
attinyx61opti.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx61opti.menu.clock.crystal_12m.build.speed=12
attinyx61opti.menu.clock.crystal_12m.build.clocksource=1
attinyx61opti.menu.clock.crystal_6m=6 MHz (crystal)
attinyx61opti.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attinyx61opti.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx61opti.menu.clock.crystal_6m.build.speed=6
attinyx61opti.menu.clock.crystal_6m.build.clocksource=1
attinyx61opti.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx61opti.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx61opti.menu.clock.crystal_18432k.build.speed=18432k
attinyx61opti.menu.clock.crystal_18432k.build.clocksource=1
attinyx61opti.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx61opti.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx61opti.menu.clock.crystal_14746k.build.speed=14746k
attinyx61opti.menu.clock.crystal_14746k.build.clocksource=1
attinyx61opti.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx61opti.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx61opti.menu.clock.crystal_11059k.build.speed=11059k
attinyx61opti.menu.clock.crystal_11059k.build.clocksource=1
attinyx61opti.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx61opti.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attinyx61opti.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx61opti.menu.clock.crystal_9216k.build.speed=9216k
attinyx61opti.menu.clock.crystal_9216k.build.clocksource=1
attinyx61opti.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx61opti.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attinyx61opti.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx61opti.menu.clock.crystal_7372k.build.speed=7372k
attinyx61opti.menu.clock.crystal_7372k.build.clocksource=1
attinyx61opti.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx61opti.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx61opti.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx61opti.menu.clock.internal_12m.build.speed=12m
attinyx61opti.menu.clock.internal_12m.build.clocksource=0
attinyx61opti.menu.clock.internal_12m.upload.speed=115200
attinyx61opti.menu.clock.internal_12m8=12.8 MHz (internal, tuned)
attinyx61opti.menu.clock.internal_12m8.bootloader.low_fuses=0xE2
attinyx61opti.menu.clock.internal_12m8.build.f_cpu=12800000L
attinyx61opti.menu.clock.internal_12m8.build.speed=12m
attinyx61opti.menu.clock.internal_12m8.build.clocksource=0
attinyx61opti.menu.clock.internal_12m8.upload.speed=115200
attinyx61opti.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx61opti.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attinyx61opti.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attinyx61opti.menu.clock.internal_8m_tuned.build.speed=8m
attinyx61opti.menu.clock.internal_8m_tuned.build.clocksource=0
attinyx61opti.menu.clock.internal_8m_tuned.upload.speed=76800
attinyx61opti.menu.clock.extclk_16m=16 MHz (external clock)
attinyx61opti.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx61opti.menu.clock.extclk_16m.build.speed=16
attinyx61opti.menu.clock.extclk_16m.build.clocksource=2
attinyx61opti.menu.clock.extclk_16m.upload.speed=76800
attinyx61opti.menu.clock.extclk_8m=8 MHz (external clock)
attinyx61opti.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx61opti.menu.clock.extclk_8m.build.speed=8
attinyx61opti.menu.clock.extclk_8m.build.clocksource=2
attinyx61opti.menu.clock.extclk_8m.upload.speed=76800
attinyx61opti.menu.clock.extclk_20m=20 MHz (external clock)
attinyx61opti.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx61opti.menu.clock.extclk_20m.build.speed=20
attinyx61opti.menu.clock.extclk_20m.build.clocksource=2
attinyx61opti.menu.clock.extclk_20m.upload.speed=115200
attinyx61opti.menu.clock.extclk_12m=12 MHz (external clock)
attinyx61opti.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx61opti.menu.clock.extclk_12m.build.speed=12
attinyx61opti.menu.clock.extclk_12m.build.clocksource=2
attinyx61opti.menu.clock.extclk_12m.upload.speed=115200
attinyx61opti.menu.clock.extclk_6m=6 MHz (external clock)
attinyx61opti.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx61opti.menu.clock.extclk_6m.build.speed=6
attinyx61opti.menu.clock.extclk_6m.build.clocksource=2
attinyx61opti.menu.clock.extclk_6m.upload.speed=57600
attinyx61opti.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx61opti.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx61opti.menu.clock.extclk_18432k.build.speed=18432k
attinyx61opti.menu.clock.extclk_18432k.build.clocksource=2
attinyx61opti.menu.clock.extclk_18432k.upload.speed=115200
attinyx61opti.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx61opti.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx61opti.menu.clock.extclk_14746k.build.speed=14746k
attinyx61opti.menu.clock.extclk_14746k.build.clocksource=2
attinyx61opti.menu.clock.extclk_14746k.upload.speed=115200
attinyx61opti.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx61opti.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx61opti.menu.clock.extclk_11059k.build.speed=11059k
attinyx61opti.menu.clock.extclk_11059k.build.clocksource=2
attinyx61opti.menu.clock.extclk_11059k.upload.speed=115200
attinyx61opti.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx61opti.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx61opti.menu.clock.extclk_9216k.build.speed=9216k
attinyx61opti.menu.clock.extclk_9216k.build.clocksource=2
attinyx61opti.menu.clock.extclk_9216k.upload.speed=115200
attinyx61opti.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx61opti.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx61opti.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx61opti.menu.clock.extclk_7372k.build.speed=7372k
attinyx61opti.menu.clock.extclk_7372k.build.clocksource=2
attinyx61opti.menu.clock.extclk_7372k.upload.speed=76800

#########################
# Pin Mapping menu      #
#########################
attinyx61opti.menu.pinmap.default=Standard
attinyx61opti.menu.pinmap.legacy=Legacy
attinyx61opti.menu.pinmap.legacy.build.variant=tinyx61_legacy
attinyx61opti.menu.pinmap.default.build.pinmapabr=
attinyx61opti.menu.pinmap.legacy.build.pinmapabr=.old

#########################
# Software Serial menu  #
#########################
attinyx61opti.menu.softserial.enable_AIN1=RX on PA7, TX on PA (default PA6)
attinyx61opti.menu.softserial.enable_AIN0=RX on PA6, TX on PA (default PA7)
attinyx61opti.menu.softserial.enable_AIN0.build.softser=-DSOFTSERIAL_RXAIN0
attinyx61opti.menu.softserial.enable_AIN0.build.softserabr=ssAIN0
attinyx61opti.menu.softserial.enable_AIN2=RX on PA5, TX on PA (default PA6)
attinyx61opti.menu.softserial.enable_AIN2.build.softser=-DSOFTSERIAL_RXAIN2
attinyx61opti.menu.softserial.enable_AIN2.build.softserabr=ssAIN2
attinyx61opti.menu.softserial.txonly=No receiving, transmit only.
attinyx61opti.menu.softserial.txonly.build.softserabr=ssTX
attinyx61opti.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY

#########################
# BrownOut Detect menu  #
#########################
attinyx61opti.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx61opti.menu.bod.disable.bootloader.bod_bits=111
attinyx61opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx61opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx61opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61opti.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx61opti.menu.millis.enabled=Enabled
attinyx61opti.menu.millis.enabled.build.millis=
attinyx61opti.menu.millis.enabled.build.millisabr=
attinyx61opti.menu.millis.disabled=Disabled (saves flash)
attinyx61opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx61opti.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx61opti.menu.bootloadermode.1s=Standard (1s wait, for use w/autoreset)
attinyx61opti.menu.bootloadermode.1s.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}.hex
attinyx61opti.menu.bootloadermode.8s=8-second (8s wait, for use w. out/autoreset)
attinyx61opti.menu.bootloadermode.8s_8sec.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}_8sec.hex

