SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                   ###   ##   ###       ###
#  #   #   #    #  #            #   # #  # #   #     #   #       #  #
#  #####   #   ###    ###  #  #  ###    #   ###      #   # ###  ###
#  #   #   #    #  #  #  # #  # #   #  #   #   #     #   # #  #  #  #
#  #   #   #    #  #  #  #  ###  ###  ####  ###       ###  ###   #  #
#_____________________________#____________________________#____________________
                           ###                             #

attiny828opti.build.board=AVR_ATTINY828
attiny828opti.build.core=tiny
attiny828opti.build.variant=tiny828
attiny828opti.build.export_merged_output=false
attiny828opti.bootloader.extended_fuses=0b{bootloader.bodpd_bits}{bootloader.bodact_bits}1100
attiny828opti.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny828opti.bootloader.rstbit=1
attiny828opti.build.usbpinset=
attiny828opti.build.tuneorcal=
attiny828opti.build.softserabr=
attiny828opti.build.softser=
attiny828opti.upload.tool=avrdude
attiny828opti.bootloader.tool=avrdude
attiny828opti.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
attiny828opti.build.bootloader=-DUSING_BOOTLOADER=0x01
attiny828opti.bootloader.speed={build.f_cpu}
attiny828opti.upload.protocol=arduino
attiny828opti.bootloader.uart=
attiny828opti.build.mcu=attiny828

#########################
# Clocking menu options #
#########################
attiny828opti.menu.clock.internal_8m_4v5=8 MHz (internal > 4.5V)
attiny828opti.menu.clock.internal_8m_4v5.bootloader.low_fuses=0xE2
attiny828opti.menu.clock.internal_8m_4v5.build.f_cpu=8000000L
attiny828opti.menu.clock.internal_8m_4v5.build.speed=8m
attiny828opti.menu.clock.internal_8m_4v5.build.clocksource=0
attiny828opti.menu.clock.internal_8m_4v5.build.tuneorcal=-DCAL_NUDGE_DOWN
attiny828opti.menu.clock.internal_8m_4v5.upload.speed=76800
attiny828opti.menu.clock.internal_8m=8 MHz (internal)
attiny828opti.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny828opti.menu.clock.internal_8m.build.f_cpu=8000000L
attiny828opti.menu.clock.internal_8m.build.speed=8m
attiny828opti.menu.clock.internal_8m.build.clocksource=0
attiny828opti.menu.clock.internal_8m.upload.speed=76800
attiny828opti.menu.clock.internal_1m=1 MHz (internal)
attiny828opti.menu.clock.internal_1m.bootloader.low_fuses=0x62
attiny828opti.menu.clock.internal_1m.build.f_cpu=1000000L
attiny828opti.menu.clock.internal_1m.build.speed=1m
attiny828opti.menu.clock.internal_1m.build.clocksource=0x10
attiny828opti.menu.clock.internal_1m.upload.speed=9600
attiny828opti.menu.clock.internal_4m=4 MHz (internal)
attiny828opti.menu.clock.internal_4m.bootloader.low_fuses=0x62
attiny828opti.menu.clock.internal_4m.build.f_cpu=4000000L
attiny828opti.menu.clock.internal_4m.build.speed=4m
attiny828opti.menu.clock.internal_4m.build.clocksource=0x10
attiny828opti.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attiny828opti.menu.clock.internal_4m.upload.speed=9600
attiny828opti.menu.clock.internal_2m=2 MHz (internal)
attiny828opti.menu.clock.internal_2m.bootloader.low_fuses=0x62
attiny828opti.menu.clock.internal_2m.build.f_cpu=2000000L
attiny828opti.menu.clock.internal_2m.build.speed=2m
attiny828opti.menu.clock.internal_2m.build.clocksource=0x10
attiny828opti.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attiny828opti.menu.clock.internal_2m.upload.speed=9600
attiny828opti.menu.clock.internal_12m=12 MHz (internal, tuned)
attiny828opti.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny828opti.menu.clock.internal_12m.build.f_cpu=12000000L
attiny828opti.menu.clock.internal_12m.build.speed=12m
attiny828opti.menu.clock.internal_12m.build.clocksource=0
attiny828opti.menu.clock.internal_12m.upload.speed=115200
attiny828opti.menu.clock.internal_12m8=12.8 MHz (internal, tuned)
attiny828opti.menu.clock.internal_12m8.bootloader.low_fuses=0xE2
attiny828opti.menu.clock.internal_12m8.build.f_cpu=12800000L
attiny828opti.menu.clock.internal_12m8.build.speed=12m
attiny828opti.menu.clock.internal_12m8.build.clocksource=0
attiny828opti.menu.clock.internal_12m8.upload.speed=115200
attiny828opti.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attiny828opti.menu.clock.internal_8m_tuned_low.bootloader.low_fuses=0xE2
attiny828opti.menu.clock.internal_8m_tuned_low.build.f_cpu=8000000L
attiny828opti.menu.clock.internal_8m_tuned_low.build.speed=8m
attiny828opti.menu.clock.internal_8m_tuned_low.build.clocksource=0
attiny828opti.menu.clock.internal_8m_tuned_low.upload.speed=76800
attiny828opti.menu.clock.internal_8m_tuned_high=8 MHz (internal, tuned)
attiny828opti.menu.clock.internal_8m_tuned_high.bootloader.low_fuses=0xE2
attiny828opti.menu.clock.internal_8m_tuned_high.build.f_cpu=8000000L
attiny828opti.menu.clock.internal_8m_tuned_high.build.speed=8m
attiny828opti.menu.clock.internal_8m_tuned_high.build.clocksource=0
attiny828opti.menu.clock.internal_8m_tuned_high.upload.speed=76800
attiny828opti.menu.clock.extclk_16m=16 MHz (external clock)
attiny828opti.menu.clock.extclk_16m.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_16m.build.f_cpu=16000000UL
attiny828opti.menu.clock.extclk_16m.build.speed=16
attiny828opti.menu.clock.extclk_16m.build.clocksource=2
attiny828opti.menu.clock.extclk_16m.upload.speed=76800
attiny828opti.menu.clock.extclk_8m=8 MHz (external clock)
attiny828opti.menu.clock.extclk_8m.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_8m.build.f_cpu=8000000UL
attiny828opti.menu.clock.extclk_8m.build.speed=8
attiny828opti.menu.clock.extclk_8m.build.clocksource=2
attiny828opti.menu.clock.extclk_8m.upload.speed=76800
attiny828opti.menu.clock.extclk_20m=20 MHz (external clock)
attiny828opti.menu.clock.extclk_20m.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_20m.build.f_cpu=20000000UL
attiny828opti.menu.clock.extclk_20m.build.speed=20
attiny828opti.menu.clock.extclk_20m.build.clocksource=2
attiny828opti.menu.clock.extclk_20m.upload.speed=115200
attiny828opti.menu.clock.extclk_12m=12 MHz (external clock)
attiny828opti.menu.clock.extclk_12m.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_12m.build.f_cpu=12000000UL
attiny828opti.menu.clock.extclk_12m.build.speed=12
attiny828opti.menu.clock.extclk_12m.build.clocksource=2
attiny828opti.menu.clock.extclk_12m.upload.speed=115200
attiny828opti.menu.clock.extclk_6m=6 MHz (external clock)
attiny828opti.menu.clock.extclk_6m.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_6m.build.f_cpu=6000000UL
attiny828opti.menu.clock.extclk_6m.build.speed=6
attiny828opti.menu.clock.extclk_6m.build.clocksource=2
attiny828opti.menu.clock.extclk_6m.upload.speed=57600
attiny828opti.menu.clock.extclk_18432k=18.432 MHz (external clock)
attiny828opti.menu.clock.extclk_18432k.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attiny828opti.menu.clock.extclk_18432k.build.speed=18432k
attiny828opti.menu.clock.extclk_18432k.build.clocksource=2
attiny828opti.menu.clock.extclk_18432k.upload.speed=115200
attiny828opti.menu.clock.extclk_14746k=14.746 MHz (external clock)
attiny828opti.menu.clock.extclk_14746k.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attiny828opti.menu.clock.extclk_14746k.build.speed=14746k
attiny828opti.menu.clock.extclk_14746k.build.clocksource=2
attiny828opti.menu.clock.extclk_14746k.upload.speed=115200
attiny828opti.menu.clock.extclk_11059k=11.059 MHz (external clock)
attiny828opti.menu.clock.extclk_11059k.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attiny828opti.menu.clock.extclk_11059k.build.speed=11059k
attiny828opti.menu.clock.extclk_11059k.build.clocksource=2
attiny828opti.menu.clock.extclk_11059k.upload.speed=115200
attiny828opti.menu.clock.extclk_9216k=9.216 MHz (external clock)
attiny828opti.menu.clock.extclk_9216k.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attiny828opti.menu.clock.extclk_9216k.build.speed=9216k
attiny828opti.menu.clock.extclk_9216k.build.clocksource=2
attiny828opti.menu.clock.extclk_9216k.upload.speed=115200
attiny828opti.menu.clock.extclk_7372k=7.372 MHz (external clock)
attiny828opti.menu.clock.extclk_7372k.bootloader.low_fuses=0xEC
attiny828opti.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attiny828opti.menu.clock.extclk_7372k.build.speed=7372k
attiny828opti.menu.clock.extclk_7372k.build.clocksource=2
attiny828opti.menu.clock.extclk_7372k.upload.speed=76800

#########################
# Wire Modes menu       #
#########################
attiny828opti.menu.wiremode.master=Master Only
attiny828opti.menu.wiremode.master.build.wiremode=-DWIRE_MASTER_ONLY
attiny828opti.menu.wiremode.slave=Slave Only
attiny828opti.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attiny828opti.menu.wiremode.slave.build.wiremodeabr=wS
attiny828opti.menu.wiremode.both=Either (uses more flash)
attiny828opti.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attiny828opti.menu.wiremode.slave.build.wiremodeabr=wB

#########################
# BrownOut Detect menu  #
#########################
attiny828opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828opti.menu.bod.1v8.bootloader.bod_bits=110
attiny828opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828opti.menu.bod.2v7.bootloader.bod_bits=101
attiny828opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828opti.menu.bod.4v3.bootloader.bod_bits=100
attiny828opti.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny828opti.menu.bodact.disabled.bootloader.bodact_bits=11
attiny828opti.menu.bodact.enabled=B.O.D. Enabled
attiny828opti.menu.bodact.enabled.bootloader.bodact_bits=10
attiny828opti.menu.bodact.sampled=B.O.D. Sampled Mode
attiny828opti.menu.bodact.sampled.bootloader.bodact_bits=01
attiny828opti.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny828opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny828opti.menu.bodpd.enabled=B.O.D. Enabled
attiny828opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny828opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny828opti.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attiny828opti.menu.millis.enabled=Enabled
attiny828opti.menu.millis.enabled.build.millis=
attiny828opti.menu.millis.enabled.build.millisabr=
attiny828opti.menu.millis.disabled=Disabled (saves flash)
attiny828opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny828opti.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attiny828opti.menu.bootloadermode.1s=Standard (1s wait, for use w/autoreset)
attiny828opti.menu.bootloadermode.1s.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}.hex
attiny828opti.menu.bootloadermode.8s=8-second (8s wait, for use w. out/autoreset)
attiny828opti.menu.bootloadermode.8s_8sec.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}_8sec.hex

