SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      #  #         #   #  ###  ####
#  #   #   #    #  #                #  #         #   # #     #   #
#  #####   #   ###    ###  #  # # # ####     # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #     #     # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # #    #      #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attinyx4micr.build.board=AVR_ATTINYX4
attinyx4micr.build.core=tiny
attinyx4micr.build.variant=tinyx4_cw
attinyx4micr.build.export_merged_output=false
attinyx4micr.bootloader.extended_fuses=0xFE
attinyx4micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx4micr.bootloader.rstbit=1
attinyx4micr.build.usbpinset=
attinyx4micr.build.tuneorcal=
attinyx4micr.build.softserabr=
attinyx4micr.build.softser=
attinyx4micr.build.wiremodeabr=
attinyx4micr.build.wiremode=
attinyx4micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attinyx4micr.upload.tool=micronucleus
attinyx4micr.build.mcu=attinyx4

#########################
# Clocking menu options #
#########################
attinyx4micr.menu.clock.internal_8m=8 MHz
attinyx4micr.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx4micr.menu.clock.internal_8m.build.f_cpu=12000000L
attinyx4micr.menu.clock.internal_8m.build.speed=12m
attinyx4micr.menu.clock.internal_8m.build.clocksource=0
attinyx4micr.menu.clock.internal_8m.build.extra_flags=-DBOOT_TUNED120
attinyx4micr.menu.clock.internal_12m=12 MHz (tuned by bootloader)
attinyx4micr.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx4micr.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx4micr.menu.clock.internal_12m.build.speed=12m
attinyx4micr.menu.clock.internal_12m.build.clocksource=0
attinyx4micr.menu.clock.internal_12m.build.extra_flags=-DBOOT_TUNED120

#########################
# Pin Mapping menu      #
#########################
attinyx4micr.menu.pinmap.default=Standard (clockwise)
attinyx4micr.menu.pinmap.ccw=Legacy (counterclockwise)
attinyx4micr.menu.pinmap.ccw.build.variant=tinyx4_legacy
attinyx4micr.menu.pinmap.default.build.pinmapabr=.cw
attinyx4micr.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# Software Serial menu  #
#########################
attinyx4micr.menu.softserial.enable=RX on PA2, TX on PA (default PA1)
attinyx4micr.menu.softserial.txonly=No receiving, transmit only.
attinyx4micr.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attinyx4micr.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attinyx4micr.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx4micr.menu.bod.disable.bootloader.bod_bits=111
attinyx4micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx4micr.menu.bod.1v8.bootloader.bod_bits=110
attinyx4micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx4micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx4micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx4micr.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx4micr.menu.millis.enabled=Enabled
attinyx4micr.menu.millis.enabled.build.millis=
attinyx4micr.menu.millis.enabled.build.millisabr=
attinyx4micr.menu.millis.disabled=Disabled (saves flash)
attinyx4micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx4micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx4micr.menu.bootloadermode.extrf_porf=External Reset and Power On Reset
attinyx4micr.menu.bootloadermode.extrf_porf.bootloader.entrymode=extrf_porf
attinyx4micr.menu.bootloadermode.extrf_safe=External Reset, or if reset pin disabled and HIGH
attinyx4micr.menu.bootloadermode.extrf_safe.bootloader.entrymode=extrf_safe
attinyx4micr.menu.bootloadermode.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attinyx4micr.menu.bootloadermode.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attinyx4micr.menu.bootloadermode.wdrf=Watchdog Reset only
attinyx4micr.menu.bootloadermode.wdrf.bootloader.entrymode=wdrf
attinyx4micr.menu.bootloadermode.extrf=Power On Reset only
attinyx4micr.menu.bootloadermode.porf.bootloader.entrymode=porf.menu.bootloadermode.anyreset=Any reset (but not jump from app)
attinyx4micr.menu.bootloadermode.anyreset.bootloader.entrymode=anyreset
attinyx4micr.menu.bootloadermode.always=Always (permits jump from app)
attinyx4micr.menu.bootloadermode.always.bootloader.entrymode=always
attinyx4micr.menu.bootloadermode.jumper=Jumper (see documentation) (permits jump from app)
attinyx4micr.menu.bootloadermode.jumper.bootloader.entrymode=jumper
attinyx4micr.menu.bootloadermode.extrf=External Reset - DANGER: If reset is disabled, will brick chip
attinyx4micr.menu.bootloadermode.extrf.bootloader.entrymode=extrf
attinyx4micr.menu.bootloadermode.extrfonly=External Reset only - DANGER: If reset is disabled, will brick chip
attinyx4micr.menu.bootloadermode.extrfonly.bootloader.entrymode=extrfonly

################################
# Pins used for USB            #
################################
attinyx4micr.menu.usbpins.pb2plus=PB0: LED, PB1: D-, PB2: D+
attinyx4micr.menu.usbpins.pb1plus=PB0: D-, PB1: D+, PB2: LED
attinyx4micr.menu.usbpins.pb0plus=PB0: D+, PB1: D-, PB2: LED
attinyx4micr.menu.usbpins.pb2plus.build.usbpinset=-DUSB_TWOPLUS
attinyx4micr.menu.usbpins.pb1plus.build.usbpinset=-DUSB_ONEPLUS
attinyx4micr.menu.usbpins.pb0plus.build.usbpinset=-DUSB_ZEROPLUS
attinyx4micr.menu.usbpins.pb2plus.bootloader.pinsetpostfix=_pb2plus
attinyx4micr.menu.usbpins.pb1plus.bootloader.pinsetpostfix=_pb1plus
attinyx4micr.menu.usbpins.pb0plus.bootloader.pinsetpostfix=_pb0plus
attinyx4micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attinyx4micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx4micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attinyx4micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attinyx4micr.menu.burnmode.upgrade=Upgrade (via USB)
attinyx4micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attinyx4micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx4micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx4micr.menu.burnmode.install=Fresh Install (via ISP)
attinyx4micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attinyx4micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx4micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx4micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

