SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      ####         #   #  ###  ####
#  #   #   #    #  #                #            #   # #     #   #
#  #####   #   ###    ###  #  # # # ###      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #     #     # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # # ###       #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attinyx5micr.build.board=AVR_ATTINYX5
attinyx5micr.build.core=tiny
attinyx5micr.build.variant=tinyx5
attinyx5micr.build.export_merged_output=false
attinyx5micr.bootloader.extended_fuses=0xFE
attinyx5micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx5micr.bootloader.rstbit=1
attinyx5micr.build.usbpinset=
attinyx5micr.build.tuneorcal=
attinyx5micr.build.softserabr=
attinyx5micr.build.softser=
attinyx5micr.build.wiremodeabr=
attinyx5micr.build.wiremode=
attinyx5micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attinyx5micr.upload.tool=micronucleus
attinyx5micr.build.mcu=attinyx5

#########################
# Clocking menu options #
#########################
attinyx5micr.build.extra_flags=-DBOOT_TUNED165
attinyx5micr.menu.clock.pll_165m=16.5 MHz (internal tuned PLL)
attinyx5micr.menu.clock.pll_165m.bootloader.low_fuses=0xF1
attinyx5micr.menu.clock.pll_165m.build.f_cpu=16500000UL
attinyx5micr.menu.clock.pll_165m.build.speed=16m5
attinyx5micr.menu.clock.pll_165m.build.clocksource=6
attinyx5micr.menu.clock.pll_16m=16 MHz (internal PLL)
attinyx5micr.menu.clock.pll_16m.bootloader.low_fuses=0xF1
attinyx5micr.menu.clock.pll_16m.build.f_cpu=16000000UL
attinyx5micr.menu.clock.pll_16m.build.speed=16
attinyx5micr.menu.clock.pll_16m.build.clocksource=6
attinyx5micr.menu.clock.pll_8m=8 MHz (prescaled 16 MHz internal PLL)
attinyx5micr.menu.clock.pll_8m.bootloader.low_fuses=0xF1
attinyx5micr.menu.clock.pll_8m.build.f_cpu=8000000UL
attinyx5micr.menu.clock.pll_8m.build.speed=8
attinyx5micr.menu.clock.pll_8m.build.clocksource=6
attinyx5micr.menu.clock.pll_4m=4 MHz (prescaled 16 MHz internal PLL)
attinyx5micr.menu.clock.pll_4m.bootloader.low_fuses=0xF1
attinyx5micr.menu.clock.pll_4m.build.f_cpu=4000000UL
attinyx5micr.menu.clock.pll_4m.build.speed=4
attinyx5micr.menu.clock.pll_4m.build.clocksource=6
attinyx5micr.menu.clock.pll_2m=2 MHz (prescaled 16 MHz internal PLL)
attinyx5micr.menu.clock.pll_2m.bootloader.low_fuses=0xF1
attinyx5micr.menu.clock.pll_2m.build.f_cpu=2000000UL
attinyx5micr.menu.clock.pll_2m.build.speed=2
attinyx5micr.menu.clock.pll_2m.build.clocksource=6
attinyx5micr.menu.clock.pll_1m=1 MHz (prescaled 16 MHz internal PLL)
attinyx5micr.menu.clock.pll_1m.bootloader.low_fuses=0xF1
attinyx5micr.menu.clock.pll_1m.build.f_cpu=1000000UL
attinyx5micr.menu.clock.pll_1m.build.speed=1
attinyx5micr.menu.clock.pll_1m.build.clocksource=6

#########################
# Software Serial menu  #
#########################
attinyx5micr.menu.softserial.enable=RX on PB1, TX on PB (default PB0)
attinyx5micr.menu.softserial.txonly=No receiving, transmit only.
attinyx5micr.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attinyx5micr.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attinyx5micr.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx5micr.menu.bod.disable.bootloader.bod_bits=111
attinyx5micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx5micr.menu.bod.1v8.bootloader.bod_bits=110
attinyx5micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx5micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx5micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx5micr.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx5micr.menu.millis.enabled=Enabled
attinyx5micr.menu.millis.enabled.build.millis=
attinyx5micr.menu.millis.enabled.build.millisabr=
attinyx5micr.menu.millis.disabled=Disabled (saves flash)
attinyx5micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx5micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx5micr.menu.bootloadermode.extrf_porf=External Reset and Power On Reset
attinyx5micr.menu.bootloadermode.extrf_porf.bootloader.entrymode=extrf_porf
attinyx5micr.menu.bootloadermode.extrf_safe=External Reset, or if reset pin disabled and HIGH
attinyx5micr.menu.bootloadermode.extrf_safe.bootloader.entrymode=extrf_safe
attinyx5micr.menu.bootloadermode.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attinyx5micr.menu.bootloadermode.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attinyx5micr.menu.bootloadermode.wdrf=Watchdog Reset only
attinyx5micr.menu.bootloadermode.wdrf.bootloader.entrymode=wdrf
attinyx5micr.menu.bootloadermode.extrf=Power On Reset only
attinyx5micr.menu.bootloadermode.porf.bootloader.entrymode=porf.menu.bootloadermode.anyreset=Any reset (but not jump from app)
attinyx5micr.menu.bootloadermode.anyreset.bootloader.entrymode=anyreset
attinyx5micr.menu.bootloadermode.always=Always (permits jump from app)
attinyx5micr.menu.bootloadermode.always.bootloader.entrymode=always
attinyx5micr.menu.bootloadermode.jumper=Jumper (see documentation) (permits jump from app)
attinyx5micr.menu.bootloadermode.jumper.bootloader.entrymode=jumper
attinyx5micr.menu.bootloadermode.extrf=External Reset - DANGER: If reset is disabled, will brick chip
attinyx5micr.menu.bootloadermode.extrf.bootloader.entrymode=extrf
attinyx5micr.menu.bootloadermode.extrfonly=External Reset only - DANGER: If reset is disabled, will brick chip
attinyx5micr.menu.bootloadermode.extrfonly.bootloader.entrymode=extrfonly

################################
# Pins used for USB            #
################################
attinyx5micr.menu.usbpins.standard=Standard, PB3: D- PB4: D+ PB1: LED
attinyx5micr.menu.usbpins.standard.bootloader.pinsetpostfix=
attinyx5micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attinyx5micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx5micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attinyx5micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attinyx5micr.menu.burnmode.upgrade=Upgrade (via USB)
attinyx5micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attinyx5micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx5micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx5micr.menu.burnmode.install=Fresh Install (via ISP)
attinyx5micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attinyx5micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx5micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx5micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

