SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       ###          #   #  ###  ####
#  #   #   #    #  #                #   #         #   # #     #   #
#  #####   #   ###    ###  #  # # #  ###      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #  #   #     # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # #  ###       #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attinyx8micr.build.board=AVR_ATTINYX8
attinyx8micr.build.core=tiny
attinyx8micr.build.variant=tinyx8_MH
attinyx8micr.build.export_merged_output=false
attinyx8micr.bootloader.extended_fuses=0xFE
attinyx8micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx8micr.bootloader.rstbit=1
attinyx8micr.build.usbpinset=
attinyx8micr.build.tuneorcal=
attinyx8micr.build.softserabr=
attinyx8micr.build.softser=
attinyx8micr.build.wiremodeabr=
attinyx8micr.build.wiremode=
attinyx8micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attinyx8micr.upload.tool=micronucleus
attinyx8micr.build.mcu=attinyx8

#########################
# Clocking menu options #
#########################
attinyx8micr.menu.clock.extclk_16m=16 MHz (external clock)
attinyx8micr.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx8micr.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx8micr.menu.clock.extclk_16m.build.speed=16
attinyx8micr.menu.clock.extclk_16m.build.clocksource=2
attinyx8micr.menu.clock.extclk_8m=8 MHz (prescaled 16 MHz external clock)
attinyx8micr.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx8micr.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx8micr.menu.clock.extclk_8m.build.speed=8
attinyx8micr.menu.clock.extclk_8m.build.clocksource=0x12
attinyx8micr.menu.clock.extclk_4m=4 MHz (prescaled 16 MHz external clock)
attinyx8micr.menu.clock.extclk_4m.bootloader.low_fuses=0xE0
attinyx8micr.menu.clock.extclk_4m.build.f_cpu=4000000UL
attinyx8micr.menu.clock.extclk_4m.build.speed=4
attinyx8micr.menu.clock.extclk_4m.build.clocksource=0x12
attinyx8micr.menu.clock.extclk_2m=2 MHz (prescaled 16 MHz external clock)
attinyx8micr.menu.clock.extclk_2m.bootloader.low_fuses=0xE0
attinyx8micr.menu.clock.extclk_2m.build.f_cpu=2000000UL
attinyx8micr.menu.clock.extclk_2m.build.speed=2
attinyx8micr.menu.clock.extclk_2m.build.clocksource=0x12
attinyx8micr.menu.clock.extclk_1m=1 MHz (prescaled 16 MHz external clock)
attinyx8micr.menu.clock.extclk_1m.bootloader.low_fuses=0xE0
attinyx8micr.menu.clock.extclk_1m.build.f_cpu=1000000UL
attinyx8micr.menu.clock.extclk_1m.build.speed=1
attinyx8micr.menu.clock.extclk_1m.build.clocksource=0x12

#########################
# Pin Mapping menu      #
#########################
attinyx8micr.menu.pinmap.mhet=MH-Tiny
attinyx8micr.menu.pinmap.default=Standard
attinyx8micr.menu.pinmap.mhet.build.variant=tinyx8_MH
attinyx8micr.menu.pinmap.default.build.pinmapabr=
attinyx8micr.menu.pinmap.mhet.build.pinmapabr=.mhet

#########################
# Software Serial menu  #
#########################
attinyx8micr.menu.softserial.enable=RX on PD7, TX on PD (default PD6)
attinyx8micr.menu.softserial.txonly=No receiving, transmit only.
attinyx8micr.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attinyx8micr.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attinyx8micr.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx8micr.menu.bod.disable.bootloader.bod_bits=111
attinyx8micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8micr.menu.bod.1v8.bootloader.bod_bits=110
attinyx8micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx8micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8micr.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx8micr.menu.millis.enabled=Enabled
attinyx8micr.menu.millis.enabled.build.millis=
attinyx8micr.menu.millis.enabled.build.millisabr=
attinyx8micr.menu.millis.disabled=Disabled (saves flash)
attinyx8micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx8micr.menu.bootloadermode.extrf_porf=External Reset and Power On Reset
attinyx8micr.menu.bootloadermode.extrf_porf.bootloader.entrymode=extrf_porf
attinyx8micr.menu.bootloadermode.extrf_safe=External Reset, or if reset pin disabled and HIGH
attinyx8micr.menu.bootloadermode.extrf_safe.bootloader.entrymode=extrf_safe
attinyx8micr.menu.bootloadermode.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attinyx8micr.menu.bootloadermode.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attinyx8micr.menu.bootloadermode.wdrf=Watchdog Reset only
attinyx8micr.menu.bootloadermode.wdrf.bootloader.entrymode=wdrf
attinyx8micr.menu.bootloadermode.extrf=Power On Reset only
attinyx8micr.menu.bootloadermode.porf.bootloader.entrymode=porf.menu.bootloadermode.anyreset=Any reset (but not jump from app)
attinyx8micr.menu.bootloadermode.anyreset.bootloader.entrymode=anyreset
attinyx8micr.menu.bootloadermode.always=Always (permits jump from app)
attinyx8micr.menu.bootloadermode.always.bootloader.entrymode=always
attinyx8micr.menu.bootloadermode.jumper=Jumper (see documentation) (permits jump from app)
attinyx8micr.menu.bootloadermode.jumper.bootloader.entrymode=jumper
attinyx8micr.menu.bootloadermode.extrf=External Reset - DANGER: If reset is disabled, will brick chip
attinyx8micr.menu.bootloadermode.extrf.bootloader.entrymode=extrf
attinyx8micr.menu.bootloadermode.extrfonly=External Reset only - DANGER: If reset is disabled, will brick chip
attinyx8micr.menu.bootloadermode.extrfonly.bootloader.entrymode=extrfonly

################################
# Pins used for USB            #
################################
attinyx8micr.menu.usbpins.standard=MH Tiny - PD1: D-, PD2: D+, PD0: LED
attinyx8micr.menu.usbpins.standard.bootloader.pinsetpostfix=
attinyx8micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attinyx8micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx8micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attinyx8micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attinyx8micr.menu.burnmode.upgrade=Upgrade (via USB)
attinyx8micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attinyx8micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx8micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx8micr.menu.burnmode.install=Fresh Install (via ISP)
attinyx8micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attinyx8micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx8micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx8micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

