SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                        #    ##          #   #  ###  ####
#  #   #   #    #  #                 #    ###          #   # #     #   #
#  #####   #   ###    ###  #  # # # ####   ##      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #  #   #  ##      # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # #  ###  ####      #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attinyx61micr.build.board=AVR_ATTINYX61
attinyx61micr.build.core=tiny
attinyx61micr.build.variant=tinyx61
attinyx61micr.build.export_merged_output=false
attinyx61micr.bootloader.extended_fuses=0xFE
attinyx61micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx61micr.bootloader.rstbit=1
attinyx61micr.build.usbpinset=
attinyx61micr.build.tuneorcal=
attinyx61micr.build.softserabr=
attinyx61micr.build.softser=
attinyx61micr.build.wiremodeabr=
attinyx61micr.build.wiremode=
attinyx61micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attinyx61micr.upload.tool=micronucleus
attinyx61micr.build.mcu=attinyx61

#########################
# Clocking menu options #
#########################
attinyx61micr.build.extra_flags=-DBOOT_TUNED165
attinyx61micr.menu.clock.pll_165m=16.5 MHz (internal tuned PLL)
attinyx61micr.menu.clock.pll_165m.bootloader.low_fuses=0xF1
attinyx61micr.menu.clock.pll_165m.build.f_cpu=16500000UL
attinyx61micr.menu.clock.pll_165m.build.speed=16m5
attinyx61micr.menu.clock.pll_165m.build.clocksource=6
attinyx61micr.menu.clock.pll_16m=16 MHz (internal PLL)
attinyx61micr.menu.clock.pll_16m.bootloader.low_fuses=0xF1
attinyx61micr.menu.clock.pll_16m.build.f_cpu=16000000UL
attinyx61micr.menu.clock.pll_16m.build.speed=16
attinyx61micr.menu.clock.pll_16m.build.clocksource=6
attinyx61micr.menu.clock.pll_8m=8 MHz (prescaled 16 MHz internal PLL)
attinyx61micr.menu.clock.pll_8m.bootloader.low_fuses=0xF1
attinyx61micr.menu.clock.pll_8m.build.f_cpu=8000000UL
attinyx61micr.menu.clock.pll_8m.build.speed=8
attinyx61micr.menu.clock.pll_8m.build.clocksource=6
attinyx61micr.menu.clock.pll_4m=4 MHz (prescaled 16 MHz internal PLL)
attinyx61micr.menu.clock.pll_4m.bootloader.low_fuses=0xF1
attinyx61micr.menu.clock.pll_4m.build.f_cpu=4000000UL
attinyx61micr.menu.clock.pll_4m.build.speed=4
attinyx61micr.menu.clock.pll_4m.build.clocksource=6
attinyx61micr.menu.clock.pll_2m=2 MHz (prescaled 16 MHz internal PLL)
attinyx61micr.menu.clock.pll_2m.bootloader.low_fuses=0xF1
attinyx61micr.menu.clock.pll_2m.build.f_cpu=2000000UL
attinyx61micr.menu.clock.pll_2m.build.speed=2
attinyx61micr.menu.clock.pll_2m.build.clocksource=6
attinyx61micr.menu.clock.pll_1m=1 MHz (prescaled 16 MHz internal PLL)
attinyx61micr.menu.clock.pll_1m.bootloader.low_fuses=0xF1
attinyx61micr.menu.clock.pll_1m.build.f_cpu=1000000UL
attinyx61micr.menu.clock.pll_1m.build.speed=1
attinyx61micr.menu.clock.pll_1m.build.clocksource=6

#########################
# Pin Mapping menu      #
#########################
attinyx61micr.menu.pinmap.default=Standard
attinyx61micr.menu.pinmap.legacy=Legacy
attinyx61micr.menu.pinmap.legacy.build.variant=tinyx61_legacy
attinyx61micr.menu.pinmap.default.build.pinmapabr=
attinyx61micr.menu.pinmap.legacy.build.pinmapabr=.old

#########################
# Software Serial menu  #
#########################
attinyx61micr.menu.softserial.enable_AIN1=RX on PA7, TX on PA (default PA6)
attinyx61micr.menu.softserial.enable_AIN0=RX on PA6, TX on PA (default PA7)
attinyx61micr.menu.softserial.enable_AIN0.build.softser=-DSOFTSERIAL_RXAIN0
attinyx61micr.menu.softserial.enable_AIN0.build.softserabr=ssAIN0
attinyx61micr.menu.softserial.enable_AIN2=RX on PA5, TX on PA (default PA6)
attinyx61micr.menu.softserial.enable_AIN2.build.softser=-DSOFTSERIAL_RXAIN2
attinyx61micr.menu.softserial.enable_AIN2.build.softserabr=ssAIN2
attinyx61micr.menu.softserial.txonly=No receiving, transmit only.
attinyx61micr.menu.softserial.txonly.build.softserabr=ssTX
attinyx61micr.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY

#########################
# BrownOut Detect menu  #
#########################
attinyx61micr.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx61micr.menu.bod.disable.bootloader.bod_bits=111
attinyx61micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61micr.menu.bod.1v8.bootloader.bod_bits=110
attinyx61micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx61micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61micr.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx61micr.menu.millis.enabled=Enabled
attinyx61micr.menu.millis.enabled.build.millis=
attinyx61micr.menu.millis.enabled.build.millisabr=
attinyx61micr.menu.millis.disabled=Disabled (saves flash)
attinyx61micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx61micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx61micr.menu.bootloadermode.extrf_porf=External Reset and Power On Reset
attinyx61micr.menu.bootloadermode.extrf_porf.bootloader.entrymode=extrf_porf
attinyx61micr.menu.bootloadermode.extrf_safe=External Reset, or if reset pin disabled and HIGH
attinyx61micr.menu.bootloadermode.extrf_safe.bootloader.entrymode=extrf_safe
attinyx61micr.menu.bootloadermode.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attinyx61micr.menu.bootloadermode.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attinyx61micr.menu.bootloadermode.wdrf=Watchdog Reset only
attinyx61micr.menu.bootloadermode.wdrf.bootloader.entrymode=wdrf
attinyx61micr.menu.bootloadermode.extrf=Power On Reset only
attinyx61micr.menu.bootloadermode.porf.bootloader.entrymode=porf.menu.bootloadermode.anyreset=Any reset (but not jump from app)
attinyx61micr.menu.bootloadermode.anyreset.bootloader.entrymode=anyreset
attinyx61micr.menu.bootloadermode.always=Always (permits jump from app)
attinyx61micr.menu.bootloadermode.always.bootloader.entrymode=always
attinyx61micr.menu.bootloadermode.jumper=Jumper (see documentation) (permits jump from app)
attinyx61micr.menu.bootloadermode.jumper.bootloader.entrymode=jumper
attinyx61micr.menu.bootloadermode.extrf=External Reset - DANGER: If reset is disabled, will brick chip
attinyx61micr.menu.bootloadermode.extrf.bootloader.entrymode=extrf
attinyx61micr.menu.bootloadermode.extrfonly=External Reset only - DANGER: If reset is disabled, will brick chip
attinyx61micr.menu.bootloadermode.extrfonly.bootloader.entrymode=extrfonly

################################
# Pins used for USB            #
################################
attinyx61micr.menu.usbpins.standard=Azduino - PD1: D-, PD2, LED:PD0
attinyx61micr.menu.usbpins.standard.bootloader.pinsetpostfix=
attinyx61micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attinyx61micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx61micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attinyx61micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attinyx61micr.menu.burnmode.upgrade=Upgrade (via USB)
attinyx61micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attinyx61micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx61micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx61micr.menu.burnmode.install=Fresh Install (via ISP)
attinyx61micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attinyx61micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx61micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx61micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

