SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      #  #  ##          #   #  ###  ####
#  #   #   #    #  #                #  # ###          #   # #     #   #
#  #####   #   ###    ###  #  # # # ####  ##      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #     #  ##      # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # #    # ####      #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attinyx41micr.build.board=AVR_ATTINYX41
attinyx41micr.build.core=tiny
attinyx41micr.build.variant=tinyx41_cw
attinyx41micr.build.export_merged_output=false
attinyx41micr.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx41micr.bootloader.rstbit=1
attinyx41micr.build.usbpinset=
attinyx41micr.build.tuneorcal=
attinyx41micr.build.softserabr=
attinyx41micr.build.softser=
attinyx41micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attinyx41micr.upload.tool=micronucleus
attinyx41micr.build.mcu=attinyx41

#########################
# Clocking menu options #
#########################
attinyx41micr.menu.clock.internal_8m=8 MHz internal
attinyx41micr.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx41micr.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx41micr.menu.clock.internal_8m.build.speed=8m
attinyx41micr.menu.clock.internal_8m.build.clocksource=0
attinyx41micr.menu.clock.internal_8m.build.extra_flags=-DBOOT_TUNED120
attinyx41micr.menu.clock.internal_16m=16 MHz (internal via tuning/guess)
attinyx41micr.menu.clock.internal_16m.bootloader.low_fuses=0xE2
attinyx41micr.menu.clock.internal_16m.build.f_cpu=16000000L
attinyx41micr.menu.clock.internal_16m.build.speed=16m
attinyx41micr.menu.clock.internal_16m.build.clocksource=0
attinyx41micr.menu.clock.internal_16m.build.extra_flags=-DBOOT_TUNED120
attinyx41micr.menu.clock.internal_12m=12 MHz (tuned by bootloader)
attinyx41micr.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx41micr.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx41micr.menu.clock.internal_12m.build.speed=12m
attinyx41micr.menu.clock.internal_12m.build.clocksource=0
attinyx41micr.menu.clock.internal_12m.build.extra_flags=-DBOOT_TUNED120

#########################
# Pin Mapping menu      #
#########################
attinyx41micr.menu.pinmap.default=Standard (clockwise)
attinyx41micr.menu.pinmap.ccw=Legacy (counterclockwise)
attinyx41micr.menu.pinmap.ccw.build.variant=tinyx41_legacy
attinyx41micr.menu.pinmap.default.build.pinmapabr=.cw
attinyx41micr.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# Wire Modes menu       #
#########################
attinyx41micr.menu.wiremode.master=Master Only
attinyx41micr.menu.wiremode.master.build.wiremode=-DWIRE_MASTER_ONLY
attinyx41micr.menu.wiremode.slave=Slave Only
attinyx41micr.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attinyx41micr.menu.wiremode.slave.build.wiremodeabr=wS
attinyx41micr.menu.wiremode.both=Either (uses more flash)
attinyx41micr.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attinyx41micr.menu.wiremode.slave.build.wiremodeabr=wB

#########################
# BrownOut Detect menu  #
#########################
attinyx41micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41micr.menu.bod.1v8.bootloader.bod_bits=110
attinyx41micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx41micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41micr.menu.bod.4v3.bootloader.bod_bits=100
attinyx41micr.menu.bodact.disabled=B.O.D. Disabled (saves power)
attinyx41micr.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41micr.menu.bodact.enabled=B.O.D. Enabled
attinyx41micr.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41micr.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41micr.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41micr.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attinyx41micr.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41micr.menu.bodpd.enabled=B.O.D. Enabled
attinyx41micr.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41micr.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41micr.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attinyx41micr.menu.millis.enabled=Enabled
attinyx41micr.menu.millis.enabled.build.millis=
attinyx41micr.menu.millis.enabled.build.millisabr=
attinyx41micr.menu.millis.disabled=Disabled (saves flash)
attinyx41micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx41micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx41micr.menu.bootloadermode.extrf_porf=External Reset and Power On Reset
attinyx41micr.menu.bootloadermode.extrf_porf.bootloader.entrymode=extrf_porf
attinyx41micr.menu.bootloadermode.extrf_safe=External Reset, or if reset pin disabled and HIGH
attinyx41micr.menu.bootloadermode.extrf_safe.bootloader.entrymode=extrf_safe
attinyx41micr.menu.bootloadermode.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attinyx41micr.menu.bootloadermode.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attinyx41micr.menu.bootloadermode.wdrf=Watchdog Reset only
attinyx41micr.menu.bootloadermode.wdrf.bootloader.entrymode=wdrf
attinyx41micr.menu.bootloadermode.extrf=Power On Reset only
attinyx41micr.menu.bootloadermode.porf.bootloader.entrymode=porf.menu.bootloadermode.anyreset=Any reset (but not jump from app)
attinyx41micr.menu.bootloadermode.anyreset.bootloader.entrymode=anyreset
attinyx41micr.menu.bootloadermode.always=Always (permits jump from app)
attinyx41micr.menu.bootloadermode.always.bootloader.entrymode=always
attinyx41micr.menu.bootloadermode.jumper=Jumper (see documentation) (permits jump from app)
attinyx41micr.menu.bootloadermode.jumper.bootloader.entrymode=jumper
attinyx41micr.menu.bootloadermode.extrf=External Reset - DANGER: If reset is disabled, will brick chip
attinyx41micr.menu.bootloadermode.extrf.bootloader.entrymode=extrf
attinyx41micr.menu.bootloadermode.extrfonly=External Reset only - DANGER: If reset is disabled, will brick chip
attinyx41micr.menu.bootloadermode.extrfonly.bootloader.entrymode=extrfonly

################################
# Pins used for USB            #
################################
attinyx41micr.menu.usbpins.pb1minus=PB1: D-, PB0: D+
attinyx41micr.menu.usbpins.pb0minus=PB0: D-, PB1: D+
attinyx41micr.menu.usbpins.pb1minus.build.usbpinset=-DUSB_ONEMINUS
attinyx41micr.menu.usbpins.pb1minus.build.usbpinset=-DUSB_ZEROMINUS
attinyx41micr.menu.usbpins.pb1minus.bootloader.usbpinset=pb1minus
attinyx41micr.menu.usbpins.pb0minus.bootloader.usbpinset=pb0minus
attinyx41micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attinyx41micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx41micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attinyx41micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attinyx41micr.menu.burnmode.upgrade=Upgrade (via USB)
attinyx41micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attinyx41micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx41micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx41micr.menu.burnmode.install=Fresh Install (via ISP)
attinyx41micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attinyx41micr{bootloader.pinset}_{bootloader.entrymode}.hex
attinyx41micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx41micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

