SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                   ##    #   ###  #  #         #   #  ###  ####
#  #   #   #    #  #            ###   #       # #  #         #   # #     #   #
#  #####   #   ###    ###  #  #  ##  ####   ##  ####     # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  ##  #   #    #    #     # # #   #     # #   #
#  #   #   #    #  #  #  #  ### ####  ###  ###     #      #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attiny1634micr.build.board=AVR_ATTINY1634
attiny1634micr.build.core=tiny
attiny1634micr.build.variant=tiny1634_cw
attiny1634micr.build.export_merged_output=false
attiny1634micr.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny1634micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny1634micr.bootloader.rstbit=1
attiny1634micr.build.usbpinset=
attiny1634micr.build.tuneorcal=
attiny1634micr.build.softserabr=
attiny1634micr.build.softser=
attiny1634micr.build.wiremodeabr=
attiny1634micr.build.wiremode=
attiny1634micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attiny1634micr.upload.tool=micronucleus
attiny1634micr.build.mcu=attiny1634

#########################
# Clocking menu options #
#########################
attiny1634micr.menu.clock.internal_8m=8 MHz
attiny1634micr.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny1634micr.menu.clock.internal_8m.build.f_cpu=8000000L
attiny1634micr.menu.clock.internal_8m.build.speed=8m
attiny1634micr.menu.clock.internal_8m.build.clocksource=0
attiny1634micr.menu.clock.internal_8m.build.extra_flags=-DBOOT_TUNED120
attiny1634micr.menu.clock.internal_12m=12 MHz (tuned by bootloader)
attiny1634micr.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny1634micr.menu.clock.internal_12m.build.f_cpu=12000000L
attiny1634micr.menu.clock.internal_12m.build.speed=12m
attiny1634micr.menu.clock.internal_12m.build.clocksource=0
attiny1634micr.menu.clock.internal_12m.build.extra_flags=-DBOOT_TUNED120

#########################
# Pin Mapping menu      #
#########################
attiny1634micr.menu.pinmap.default=Standard (clockwise)
attiny1634micr.menu.pinmap.ccw=Legacy (counterclockwise)
attiny1634micr.menu.pinmap.ccw.build.variant=tiny1634_legacy
attiny1634micr.menu.pinmap.default.build.pinmapabr=.cw
attiny1634micr.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# BrownOut Detect menu  #
#########################
attiny1634micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634micr.menu.bod.1v8.bootloader.bod_bits=110
attiny1634micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634micr.menu.bod.2v7.bootloader.bod_bits=101
attiny1634micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634micr.menu.bod.4v3.bootloader.bod_bits=100
attiny1634micr.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny1634micr.menu.bodact.disabled.bootloader.bodact_bits=11
attiny1634micr.menu.bodact.enabled=B.O.D. Enabled
attiny1634micr.menu.bodact.enabled.bootloader.bodact_bits=10
attiny1634micr.menu.bodact.sampled=B.O.D. Sampled Mode
attiny1634micr.menu.bodact.sampled.bootloader.bodact_bits=01
attiny1634micr.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny1634micr.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny1634micr.menu.bodpd.enabled=B.O.D. Enabled
attiny1634micr.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny1634micr.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny1634micr.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attiny1634micr.menu.millis.enabled=Enabled
attiny1634micr.menu.millis.enabled.build.millis=
attiny1634micr.menu.millis.enabled.build.millisabr=
attiny1634micr.menu.millis.disabled=Disabled (saves flash)
attiny1634micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny1634micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attiny1634micr.menu.bootloadermode.extrf_porf=External Reset and Power On Reset
attiny1634micr.menu.bootloadermode.extrf_porf.bootloader.entrymode=extrf_porf
attiny1634micr.menu.bootloadermode.extrf_safe=External Reset, or if reset pin disabled and HIGH
attiny1634micr.menu.bootloadermode.extrf_safe.bootloader.entrymode=extrf_safe
attiny1634micr.menu.bootloadermode.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attiny1634micr.menu.bootloadermode.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attiny1634micr.menu.bootloadermode.wdrf=Watchdog Reset only
attiny1634micr.menu.bootloadermode.wdrf.bootloader.entrymode=wdrf
attiny1634micr.menu.bootloadermode.extrf=Power On Reset only
attiny1634micr.menu.bootloadermode.porf.bootloader.entrymode=porf.menu.bootloadermode.anyreset=Any reset (but not jump from app)
attiny1634micr.menu.bootloadermode.anyreset.bootloader.entrymode=anyreset
attiny1634micr.menu.bootloadermode.always=Always (permits jump from app)
attiny1634micr.menu.bootloadermode.always.bootloader.entrymode=always
attiny1634micr.menu.bootloadermode.jumper=Jumper (see documentation) (permits jump from app)
attiny1634micr.menu.bootloadermode.jumper.bootloader.entrymode=jumper
attiny1634micr.menu.bootloadermode.extrf=External Reset - DANGER: If reset is disabled, will brick chip
attiny1634micr.menu.bootloadermode.extrf.bootloader.entrymode=extrf
attiny1634micr.menu.bootloadermode.extrfonly=External Reset only - DANGER: If reset is disabled, will brick chip
attiny1634micr.menu.bootloadermode.extrfonly.bootloader.entrymode=extrfonly

################################
# Pins used for USB            #
################################
attiny1634micr.menu.usbpins.default=Standard: PC4: D-, PC5: D+, LED: 
attiny1634micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attiny1634micr.menu.resetpin.reset.bootloader.rstbit=1
attiny1634micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attiny1634micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attiny1634micr.menu.burnmode.upgrade=Upgrade (via USB)
attiny1634micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attiny1634micr{bootloader.pinset}_{bootloader.entrymode}.hex
attiny1634micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attiny1634micr.menu.burnmode.install=Fresh Install (via ISP)
attiny1634micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attiny1634micr{bootloader.pinset}_{bootloader.entrymode}.hex
attiny1634micr.menu.burnmode.install.bootloader.tool=avrdude
attiny1634micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
